{"review": "This is defiantly a DVD rental movie. I'm a big fan of the cast members but the storyline never really grabbed me. Don't expect \"Oh brother where art thou\" in any way shape or form. Funniest part in my opinion is when the war hero explains what happens over in the Argon. Seems like they were trying to copy some of Clooney's funny facial expressions from \"Oh brother where art thou\" but you could kind of tell they were trying for that. John Krasinski was the bright spot and was solid throughout. Renee Zellweger plays the part of a zealous reporter willing to do whatever for the story. Overall it's a movie worth watching at home.", "label": 0, "predicted": 1}
{"review": "Ladies and gentlemen, we've really got ourselves a winner here. Actually we don't, but boy is this film an often hilarious and always entertaining horrible hoot of a stinker. Poor Alma (fetching Julia Ruiz) is suffering from an ancient Mayan curse that causes lethal poisonous snakes to grow inside of her body. Alma and her deranged shaman husband Brujo (Alby Castro, who feverishly overacts with delicious eye-rolling intensity) stowaway on a train that's bound for Los Angeles. Naturally, a bunch of deadly vipers get lose so they can terrorize the motley assortment of passengers. The Mallachi Brothers, working from an absurd script by Eric Fosberg, treat the ridiculous premise straight, thereby creating a wonderfully wretched piece of deliriously campy cheese. The cruddy CGI effects, the pathetically unfrightening common variety Gardner snakes (there's would-be scary rattlesnake noises added to the soundtrack to imbue them with a faint sense of otherwise nonexistent menace), the plodding pace, the total dearth of any tension or momentum, the obvious rickety stage-bound train set, and especially the simply astonishing \"you gotta be kiddin' me!\" over-the-top preposterous ending are all downright awesome in their very jaw-dropping awfulness. Better still, we also got game (if lame) acting from a no-name cast, a nice smidgen of tasty gratuitous female nudity, a funky hum'n'shiver score, and plenty of extremely gross and grotesque make-up f/x. Bonus points for the fact that the token irritatingly cutesy little girl gets eaten by a large reptile and for the stoner engineer who gets caught smoking crack out of a hollow light bulb (!?). An absolute gut-buster of a kitsch howler.", "label": 1, "predicted": 0}
{"review": "Alfred Hitchcock invented any kind of thriller you could think of:he set the standards so high that any director who makes a suspense movie will be fatally compared to him.<br /><br />The main subject of this Bullock vehicle ,all the ideas,almost everything was already in Hitchcock's classic \" Rope\":the two students who commit a gratuitous crime, Nietsche's philosophy,and the clues that the boys disseminate ,the Master was the first to transfer them to the screen.And with an eighty-minute movie which was a technical riveting tour de force.<br /><br />\"Murder by numbers \" does not take place in a single room,like \"the rope\" ,mind you.And ,what a supreme originality,it pits two cops against the evil youngsters;and ,you would never guess it,these two cops are very different:actually,Bullock plays the part of woman living like a man ,and her partner (Chaplin) is as shy as a clueless girlie.The two boys' performances are not really mind-boggling ,not as good ,as ,say ,that of Edward Norton in \"primal fear\" .<br /><br />Well,you know ,\" Rope\" was so good ....", "label": 0, "predicted": 1}
{"review": "As Ben Elton once observed, nothing goes quicker out of style than comedy. Steve Martin's latest offering - 'The Pink Panther 2' - recently opened to bad reviews and dismal box-office grosses, while Mike Myers' 'The Love Guru' seems to have won few admirers.<br /><br />In 1970, it was Jerry Lewis' turn to feel the pain of rejection ( ironically, his character in this film experiences a funny turn whenever anyone uses that word in his presence ) when 'Which Way To The Front?' effectively drove him off the big screen for almost a decade.<br /><br />In this World War Two comedy, he plays 'Brendan Byers 111', the richest man in the world, who wants to join the army to do his patriotic duty ( and also because he is bored with being successful ) but is rejected as he is medically unfit. He then decides to start his own privately funded army, recruiting other 4-F's.<br /><br />Decked out with ludicrous uniforms that look like those worn by 'International Rescue' in 'Thunderbirds', they go into training. Some good visual gags here. When they fire rocket launchers, they look pleased with themselves, until they learn they have just destroyed a Texaco oil station! Wishing to learn German, Brendan plays a long-playing record called 'Songs To Mein Kampf By'. When this army sits down to eat, instead of being in a draughty mess hall, they are in an opulent room decked out with a chandelier.<br /><br />John Wood is very funny as 'Finkel', Byers' ever-so English butler. His best scene is when he blackmails a Mafia-type gangster into teaching Byers' brigade to kill.<br /><br />The script was not by Jerry himself, but by Gerald Gardiner and Dee Caruso, author of a number of episodes of 'The Monkees'. 'Front' often has the look and feel of a television sitcom, indeed at times you almost expect to hear a laugh-track.<br /><br />Where it goes badly wrong is in the last thirty minutes when Byers replaces a top Nazi commander and, after ordering the Germans to withdraw from the front, gets involved in the plot to kill Hitler ( and Tom Cruise is nowhere in sight! ). As the commander, Jerry delivers a performance of such mind-numbing ineptitude as to defy description. He gives Brian Blessed a run for his money in the 'loudest man alive' stakes. It comes as a relief when the end credits appear.<br /><br />Perhaps the timing was just wrong - bringing out a war comedy when the Vietnam conflict was raging was not a good idea. Or the public simply had had enough of Jerry ( that beard probably did not help! ). What he needed here was a good producer, someone to take him in hand and say: \"That gag stinks. Throw it out!\". 'Don't Raise The Bridge, Lower The River' is a masterpiece by comparison with this picture.<br /><br />As the '70's got underway, the new comedy icons would be Woody Allen, Mel Brooks, and Monty Python - fresher, more biting and in Allen's case, more human styles of comedy replaced Jerry's brand of slapstick. It would not be until 1982 that he would make anything like a successful comeback - as the conceited talk-show host 'Jerry Langford' in Martin Scorcese's brilliant 'The King Of Comedy'.", "label": 0, "predicted": 1}
{"review": "Just caught \"The Rain People\" on Turner Classic Movies late one night. The film was released in 1969. Shirley Knight stars as Natalie, a Long Island housewife who -- exact reasons unknown -- leaves her husband and embarks on a road trip, not knowing exactly where she is going. Natalie is also newly pregnant, which complicates things. Along the way, she picks up a brain-damaged ex-football player \"Jimmy\" (James Caan), who has been kicked out of his college and is hitchhiking. There are many twists and turns along the way between these two, as Natalie struggles to take care of Jimmy and she begins to realize he is mentally limited and cannot take care of himself. She is going through her own struggles, needless to say, and in no position to care for him. Natalie appears to be a woman on the edge of a nervous breakdown at times; she makes some odd phone calls to her husband, who begs her to come home. Natalie tries to dump Jimmy several times, only to have him re-enter her life through circumstances. A young Robert Duvall plays a strange and troubled cop who befriends Natalie. You get the sense all along that this film is going to end badly, and it does. This film is certainly uneven at times, and the script is somewhat lacking. Francis Ford Coppola directed this, and of course he would soon become immensely famous in the next few years for directing \"The Godfather.\" The actors are good ones, needless to say, as they all would have futures ahead of them in film. Shirley Knight is the least known of the three, although she is also underrated as an actor. James Caan is especially effective here and he seems to just inhabit this character. This film remains little more than a curiosity now, no doubt because it is an early movie of Coppola's, and I confess I had never heard of it. So God bless Turner Classic Movies for bringing it to a new audience.", "label": 0, "predicted": 1}
{"review": "In defense of this movie I must repeat what I had stated previously. The movie is called Arachina, it has a no name cast and I do not mean no name as in actors who play in little seen art house films. I mean no name as in your local high school decided to make a film no name and it might have a 2 dollar budget. So what does one expect? Hitchcock?<br /><br />I felt the movie never took itself seriously which automatically takes it out of the worst movie list. That list is only for big budget all star cast movies that takes itself way too seriously. THe movie The Oscar comes to mind, most of Sylvester Stallone's movies. THe two leads were not Hepburn and Tracy but they did their jobs well enough for this movie. The woman kicked butt and the guy was not a blithering idiot. The actor who played the old man was actually very good. The man who played anal retentive professor was no Clifton Webb but he did a god job. And the Bimbo's for lack of a better were played by two competent actors. I laughed at the 50 cent special effects. But that was part of the charm of the movie. It played like a hybrid Tremors meets Night of the Living Dead. The premise of the movie is just like all Giant Bug movies of the 50's. A Meteor or radiation stir up the ecosystem and before you know it we have Giant Ants, Lobsters, rocks or Lizards terrorizing the locals. A meteor was the cause of the problems this time. I was was very entertained. I didn't expect much and I go a lot more then I bargained for.", "label": 1, "predicted": 0}
{"review": "...dislike this movie and everyone would understand why. The plot is poor, so is the acting. But in my opinion it is better than Halloween 5, although even this does not give many surprising moments. A few scenes are really well directed. But these few moments do not deliver the reason to rent it. I do not despise violence in movies, but H6 features extraordinary strong and bloody scenes which do not fit to the tradition of the Halloween-Movies. The most sucking aspect about H6 is the lack of tension. No comparison to the first masterpiece.<br /><br />Halloween 6 only gets 4 out of 10 stars from me. If you want, rent it. But don't expect a great horror-experience....<br /><br />", "label": 1, "predicted": 0}
{"review": "This was Laurel and Hardy's last silent film for Roach Studios. However, since the public had a real thirst for \"talkies\", this same short was re-made by the team just a few years later with only a few small plot changes. LAUGHING GRAVY was essentially the same plot except that Stan and Ollie were trying to hide a cute puppy from their grouchy landlord--not a goat like in ANGORA LOVE. This whole goat angle is the worst part of the film. While you could understand the boys wanting to keep a cute little dog (after all, it is snowy outside), why exactly they bring a goat home is just contrived and pointless. According to the plot, the goat followed them home and so they got tired of shooing it away and kept it. Huh?! This just doesn't make any sense--if it had been a giraffe or a cow, would they have done the same thing?! Apart from being an unconvincing plot, the movie itself is pure Laurel and Hardy, with a familiar plot and familiar roles for the comedians. This film features quite a few laughs, but unfortunately isn't one of their better films to wrap up their silent careers. This aspect of their careers just seems to have ended with a whimper.", "label": 1, "predicted": 0}
{"review": "Purchased this film for one dollar and figured I could never go wrong, my big mistake was watching it. Enjoyed the acting of Ice-T and the rapping which gave lots of class to this film about Los Angeles and the world of pimps. There is a boxer who kills one of his opponents in a practice ring and who has a career, but because of mental problems from childhood and the killing of this other boxer he retires. He gets hired by a pimp who is looking for a bodyguard to protect the girls that work for him at their trade and make sure they are not beaten up. This boxer falls in love with the boss's girlfriend and all kinds of trouble starts. This is entertaining and it then becomes a big laughing comedy.", "label": 0, "predicted": 1}
{"review": "First of all, I would like to clarify that I consider this one of the funniest films I have ever seen. I have watched it almost 10 times just because I've wished to spread the deliciously tasteless innards of this film to other unsuspecting victims. It has the captivating essence of a hand-held camera recording of a distant nephew's seventh birthday. It has all the writing of a WWE match. And most of all, it has the consistency of a face scraped along a sidewalk. This movie is a masterpiece.<br /><br />The film begins with an almost instantaneous mutilation of three, drunken teens in the desert. This scene convinced me that I was onto something big when I picked this film from the DVD rack (being drawn to the box because of the graphic of a velociraptor yelling the word \"RAPTOR\" on the front of it). The scene contains such treasures as tomato sauce, spaghetti intestines, vain attempts at humour and rubbery dinosaur puppets that repeat throughout the course of the movie. This movie is a masterpiece.<br /><br />The film contains erratic backdrops and prop use that causes one's mind to melt at the thought that someone could just have so little shame when it comes to creating a film. An example is when a truck, in the middle of the night, is parked beside a cliff wall. The very next day, they find it in an open grassy area. The driver couldn't have driven it there since he had his face bitten off by an unnamed bipedal carnivore (I will explain why it's unnamed in a second). So, my only guess is that either the velociraptor drove it, the livestock the driver was transporting did it, or Jim Wynorski doesn't think very highly of his viewers. Hell, in one part they expect me to believe that they are walking down a main street at night when the road doesn't have gutters, the fire hydrant is precariously placed next to a phone booth, and there's only a single street light. Yet, still, I feel compelled to watch and re-watch this film, just so I can find more things that will make me giggle the next time I watch it. This film is a masterpiece.<br /><br />The directing on this film is horrific. Long extended pauses. Strange cuts to characters that weren't even in the general vicinity of the conversation. People discussing things casually while facing the camera (and in turn, making them face the wall). They can't even give the dinosaur a coherent species, flipping between calling it a baby dinosaur and using a rubber velociraptor puppet (distinguished by the intensely long, fat, disproportionate claw). This film is a masterpiece.<br /><br />The editing is prominent on this film. This is not a good thing. I am well aware that the film is a collection of scenes from other films, masterfully crafted into a single piece of crap, but there has to be a limit! Sub plots end as abruptly as they began. Explanations for the sudden disappearance of characters not being limited to, well, not being explained at all! And an ending that felt like driving a muscle car into a brick wall without a seat belt. You just never know what is going to happen because the film doesn't follow a coherent structure. This film is a masterpiece.<br /><br />Now, I'm going to just have to mention a single scene (the greatest one) that occurs near the end. This is a spoiler, but not really. The final scene contains a showdown between tyrannosaurus rex and Sheriff Tanner. It is like the showdown between Sigourney Weaver and the Alien Queen in Aliens, except without all the emotional power/budget/epic battling. It pretty consists of Tanner ramming the dinosaur with a piece of construction machinery. A white bobcat. In a space of several minutes, through a series of sneakily slipped in cuts, the director manages to turn that white bobcat into a yellow forklift/crane looking piece of machinery. Now, as I said, I know that this film is made from scenes from other films, but what two films warrant a showdown with a t-rex in a construction vehicle? This film is a masterpiece.<br /><br />This film gets a 1/10 for quality of film making, but a 10/10 for how much it makes me laugh and enjoy myself.", "label": 0, "predicted": 1}
